[
        {
            "id": 1,
            "title": "Wide Wheelz Shopify Hydrogen",
            "tecnologias": ["React", "Hydrogen", "ThailWind","Java Script" ],
            "category": "Full Stack",
            "image": "/images/project/wide_wheelz.png",
            "link": "/portfolio-single/1",
            "description_corta": "Wide Wheelz Shopify Hydrogen es una web desarrollada para Alwa Marketing, migrando su e-commerce desde una plantilla de Shopify a una soluci칩n personalizada con Hydrogen, React y Tailwind CSS. Con este cambio, se mejor칩 significativamente el dise침o, la experiencia de usuario y la velocidad de carga, optimizando el rendimiento de la tienda online.",
            "description_larga":[
                "Wide Wheelz Shopify Hydrogen es un proyecto desarrollado para Alwa Marketing, con el objetivo de transformar su tienda online de Shopify en una plataforma m치s r치pida, eficiente y atractiva. Inicialmente, la empresa utilizaba una plantilla est치ndar y el editor nativo de Shopify, lo que limitaba las posibilidades de personalizaci칩n y optimizaci칩n de rendimiento.",
                "Para solucionar estas limitaciones, se implement칩 una nueva versi칩n del e-commerce utilizando Hydrogen, el framework de Shopify basado en React, junto con Tailwind CSS para mejorar la apariencia y la adaptabilidad del sitio. Gracias a esta tecnolog칤a, se logr칩 un dise침o moderno y din치mico que mejora la navegaci칩n y la experiencia del usuario.",
                "Adem치s de los cambios visuales, el rendimiento del sitio se optimiz칩 significativamente, reduciendo los tiempos de carga y mejorando la usabilidad en distintos dispositivos. Esta migraci칩n permiti칩 que Wide Wheelz tenga una tienda m치s escalable, flexible y lista para futuras mejoras, garantizando una experiencia de compra m치s fluida y atractiva para los clientes."
            ],
            "imgs_description":[
                "/images/resource/image-36.jpg",
                "/images/resource/image-36.jpg",
                "/images/resource/image-36.jpg"
            ]
        },
        {
            "id": 2,
            "title": "Myc Experience",
            "tecnologias": ["React", "SASS", "Bootstrap", "Java Script"],
            "category": "Front End",
            "image": "/images/project/myc.png",
            "link": "/portfolio-single",
            "description_corta": "Myc Experience es una web dise침ada para una empresa de eventos enfocada en el ocio nocturno. Se desarroll칩 utilizando React, SASS y Bootstrap, logrando un dise침o atractivo, moderno y funcional que refleja la energ칤a y exclusividad de sus eventos, manteniendo una navegaci칩n sencilla y una experiencia de usuario fluida.",
            "description_larga":[
                "Myc Experience es un proyecto web desarrollado para una empresa de eventos especializada en ocio nocturno. La principal necesidad del cliente era contar con una p치gina web visualmente atractiva pero sin perder la sencillez en la navegaci칩n, permitiendo a los usuarios encontrar r치pidamente informaci칩n sobre sus eventos y servicios.",
                "Para lograrlo, se utiliz칩 React como base del desarrollo, junto con SASS y Bootstrap, combinando flexibilidad y rendimiento con un dise침o moderno y adaptativo. La interfaz se dise침칩 pensando en la experiencia del usuario, con una estructura clara y elementos visuales llamativos que transmiten la esencia de la marca.",
                "El resultado es una web que no solo cumple con los objetivos de la empresa, sino que tambi칠n optimiza la interacci칩n con su audiencia. Gracias a la tecnolog칤a utilizada, la plataforma es r치pida, escalable y f치cil de mantener, asegurando que Myc Experience pueda seguir evolucionando y ofreciendo una presencia digital alineada con la din치mica de sus eventos."
            ],
            "imgs_description":[
                "/images/single-project/myc/1.png",
                "/images/single-project/myc/2.png",
                "/images/single-project/myc/4.png",
                "/images/single-project/myc/3.png"
            ]
        },
        {
            "id": 3,
            "title": "Groove Call",
            "tecnologias": ["React", "CSS", "Bootstrap", "Mongo DB", "Node JS", "Express JS" ],
            "category": "Full Stack",
            "image": "/images/project/groove_call.png",
            "link": "/portfolio-single",
            "description_corta": "Groove Call es una PWA (Progressive Web App) dise침ada para revolucionar la experiencia en discotecas, permitiendo a los asistentes solicitar canciones directamente al DJ. Desarrollada con el stack MERN (MongoDB, Express.js, React.js y Node.js), la aplicaci칩n ofrece una interfaz intuitiva y cuenta con roles diferenciados para clientes, DJs y administradores del local. Disponible en groovecall.es, Groove Call sigue evolucionando con nuevas funcionalidades.",
            "description_larga":[
                "Groove Call es un ambicioso proyecto que comenz칩 como mi Trabajo de Fin de Grado, pero que ha seguido evolucionando con nuevas mejoras y funcionalidades. Se trata de una PWA (Progressive Web App) desarrollada con el stack MERN (MongoDB, Express.js, React.js y Node.js), dise침ada para transformar la experiencia en discotecas al permitir que los asistentes soliciten sus canciones favoritas directamente al DJ.",
                "La aplicaci칩n ofrece una interfaz sencilla y moderna, optimizada para su uso en m칩viles y navegadores, facilitando la interacci칩n entre los clientes y el DJ. Adem치s, Groove Call implementa un sistema de roles:Clientes: pueden solicitar canciones de manera r치pida y sencilla. DJs: acceden a un panel donde gestionan las solicitudes y el flujo de m칰sica en tiempo real. Administradores del local: pueden gestionar accesos, contrase침as y configuraci칩n general.",
                "El proyecto ha sido desplegado en un servidor VPS, utilizando Plesk y Putty para la gesti칩n del entorno, mientras que el back-end funciona como una API en Node.js, accesible a trav칠s de diferentes endpoints. La base de datos MongoDB est치 alojada en un contenedor Docker, lo que permite un despliegue eficiente y escalable. Adem치s, el front-end se ha desarrollado con React y Vite, asegurando una experiencia de usuario fluida y optimizada.",
                "Groove Call ya est치 disponible en l칤nea en groovecall.es y puede descargarse para Android e iOS. Este es solo el comienzo: nuevas funcionalidades est치n en camino para seguir mejorando la experiencia en discotecas. 游游꿨 춰칔nete a la revoluci칩n musical y desc치rgala ahora!"
            ],
            "imgs_description":[
                "/images/single-project/groovecall/1.png",
                "/images/single-project/groovecall/2.png",
                "/images/single-project/groovecall/3.png",
                "/images/single-project/groovecall/4.png"
            ]
        },
        {
            "id": 4,
            "title": "Gravity Visuals",
            "tecnologias": ["React", "SASS", "Bootstrap", "Swiper" ],
            "category": "Front End",
            "image": "/images/project/gv.png",
            "link": "/portfolio-single",
            "description_corta": "Gravity Visuals es la web de una productora audiovisual en Le칩n, dise침ada para ser impactante y visualmente atractiva. Desarrollada con React, SASS y Bootstrap, incorpora la librer칤a Swiper para mostrar videos y fotos de manera din치mica, asegurando al mismo tiempo una carga optimizada para una navegaci칩n fluida.",
            "description_larga":[
                "Gravity Visuals es la web oficial de una productora audiovisual en Le칩n, creada para reflejar la esencia de su trabajo con un dise침o que destaca por su impacto visual y dinamismo. Al tratarse de una empresa especializada en video y fotograf칤a, la prioridad era desarrollar una plataforma que captara la atenci칩n de los visitantes desde el primer momento, mostrando su contenido de manera atractiva y profesional.",
                "Para lograrlo, se utiliz칩 React como base del desarrollo, acompa침ado de SASS y Bootstrap, tecnolog칤as que permitieron construir una interfaz moderna y responsive. Adem치s, se implement칩 la librer칤a Swiper, la cual proporciona transiciones fluidas y din치micas para la visualizaci칩n de videos e im치genes, potenciando la experiencia del usuario.",
                "Uno de los desaf칤os clave fue la optimizaci칩n del contenido multimedia, asegurando que los videos y fotos se cargaran de manera eficiente sin comprometer la calidad. Se aplicaron estrategias de carga progresiva y compresi칩n de archivos, evitando tiempos de espera prolongados y garantizando una navegaci칩n fluida tanto en dispositivos m칩viles como en ordenadores.",
                "El resultado es una web que no solo representa fielmente la identidad de Gravity Visuals, sino que tambi칠n proporciona una experiencia inmersiva a los visitantes, destacando la calidad y creatividad de la productora."
            ],
            "imgs_description":[
                "/images/resource/image-36.jpg",
                "/images/resource/image-36.jpg",
                "/images/resource/image-36.jpg"
            ]
        },
        {
            "id": 5,
            "title": "NelsonDeMatosDesginer",
            "tecnologias": ["React", "SASS", "Bootstrap", "Next JS" ],
            "category": "Full Stack",
            "image": "/images/project/nelson_dev.png",
            "link": "/portfolio-single",
            "description_corta": "NelsonDeMatosDesigner es mi portafolio como desarrollador Full Stack, creado con React, Next.js, SASS y Bootstrap. Presenta un dise침o minimalista donde muestro mis proyectos, experiencia y un blog automatizado con Node.js, Express y MongoDB, permiti칠ndome publicar contenido sobre tecnolog칤a de forma din치mica.",
            "description_larga":[
                "NelsonDeMatosDesigner es mi portafolio profesional como desarrollador Full Stack, dise침ado para mostrar mis proyectos personales, experiencia laboral y conocimientos tecnol칩gicos. La web est치 construida con React y Next.js, apostando por un dise침o minimalista y moderno, donde la navegaci칩n es fluida y la informaci칩n se presenta de manera clara y estructurada.",
                "Una de las funcionalidades m치s destacadas es la secci칩n de blog, donde publico art칤culos sobre temas relevantes en la actualidad tecnol칩gica. Para gestionar este contenido, he desarrollado una API con Node.js y Express.js, conectada a una base de datos MongoDB. Esto me permite crear, almacenar y publicar nuevas entradas de forma din치mica a trav칠s de un formulario personalizado en el back-end, asegurando una administraci칩n eficiente del blog.",
                "Gracias a Next.js, la web tiene un excelente rendimiento y carga r치pida, mientras que Bootstrap y SASS me han permitido lograr una est칠tica limpia y profesional. Este portafolio no solo refleja mi habilidad t칠cnica y creatividad, sino que tambi칠n es una plataforma en constante evoluci칩n, donde seguir칠 agregando nuevas funcionalidades y contenido."
            ],
            "imgs_description":[
                "/images/resource/image-36.jpg",
                "/images/resource/image-36.jpg",
                "/images/resource/image-36.jpg"
            ]
        }
    ]